Autodesk.Revit.DB.ATFBaseExportOptions.CanSetExportGeometry(System.Boolean)
Checks if the property ShouldExportGeometry can be modified to the provided value.
Returns:
The property ShouldExportGeometry can be modified to the provided value.
Since:
2021.1

Autodesk.Revit.DB.ATFBaseExportOptions.SetElementFilter(Autodesk.Revit.DB.ElementFilter)
filter:
The ElementFilter. A copy is stored, or pass null to remove the existing filter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The options are not valid.
Since:
2021.1

Autodesk.Revit.DB.ATFBaseExportOptions.ShouldExportParameters
Indicates if the export should include parameter information.
Since:
2023

Autodesk.Revit.DB.ATFBaseExportOptions.ShouldExportGeometry
Indicates if the export should include geometry.
Since:
2023

Autodesk.Revit.DB.ATFBaseExportOptions.ElementFilter
The filter used screen exported elements. Elements that do not pass the filter are excluded from export.
Null by default, indicating that no elements are excluded.
Since:
2023

Autodesk.Revit.DB.ATFBaseExportOptions.ViewId
The element id of the 3D view to export. InvalidElementId by default.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2021.1

Autodesk.Revit.DB.ATFBaseExportOptions
The base class for options used to export using ATF.
Since:
2021.1